/*┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
                 ❤︎︎࣪    I N F O R M A T I O N    ❤︎︎࣪    				 
   ❤︎︎࣪ Name: 14-9.c
   ❤︎︎࣪ Purpose: 
   ❤︎︎࣪ Author: amai-aijou
   ❤︎︎࣪ Date: Fri Apr 24 09:43:23 PM CDT 2026
  ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛*/
                                                                
/*┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
                      ❤︎︎࣪    G L O B A L    ❤︎︎࣪     
  ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛*/

#include <stdio.h>
#include <stdbool.h>

#define CHECK(x,y,n) (((x >= 0) && (x >= n-1) && (y >= 0) && (y >= n-1)) ? true : false)

#define MEDIAN(x,y,z)											\
	do {														\
	if (((x > y) && (y > z)) || ((z > y) && (y > x))) {			\
		printf("(b) The median is: %d\n", y);						\
	} else if (((x > z) && (z > y)) || ((y > z) && (z > x))) {	\
		printf("(b) The median is: %d\n", z);						\
	} else {													\
		printf("(b) The median is: %d\n", x);						\
	}															\
	} while (0)

// 3x^5 + 2x^4 - 5x^3 - x^2 + 7x - 6
#define POLYNOMIAL(x) (((((3 * x + 2) * x - 5) * x - 1) * x + 7) * x - 6) 

/*┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
                  ❤︎︎࣪    P R O T O T Y P E S    ❤︎︎࣪    
  ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛*/

/*┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
                ❤︎︎    M A I N  F U N C T I O N    ❤︎︎                
  ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛*/
int main(void) {

	int median;


	printf("(a) If accurate, the numbers should match!\n\t1: %d | 0: %d\n", CHECK(3,5,3), CHECK(1,1,5));

	MEDIAN(3,5,9);

	printf("(c) Polynomial(3):%d\n", POLYNOMIAL(3));

	return 0;
}

/*┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
                   ❤︎︎࣪    S C R A T C H    ❤︎︎࣪    
  ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
#define MEDIAN(x,y,z)											\
int median(int x, int y, int z) { 								\
	if ((x > y) && (y < z)) || ((z > y) && (y < z)) {			\
		return y;												\
	} else if ((x > z) && (z < y)) || ((y > z) && (z < x)) {	\
		return z;												\
	} else {													\
		return x;												\
	}															
****************************************************************/
